{"title":"Out into the Country","author":"Mac","layout":"post","date":"2011-09-29 00:00:00 +0200","url":"/2011/09/29/out-into-the-country.html","id":"/2011/09/29/out-into-the-country","categories":[],"tags":[],"path":"_posts/2011-09-29-out-into-the-country.md","content":"<p>After yesterday&#8217;s visit to the allotments I was jumped at the opportunity to visit the Main Farm/Offices of food-box delivery service, <a href=\"http://www.aarstiderne.com\">Aarstriderne</a>. The company has made a name for itself in Denmark through it&#8217;s effective delivery of fresh, organic, locally grown produce to the citizens of Copenhagen. From this, and two much larger farms outside of city, the business delivers to approx. 40,000 households throughout Denmark. </p>\n\n<p>The numbers are impressive and business is obviously doing very well, but I was more interested in specifically what the business was doing in fostering knowledge and interest in organic, homegrown produce. To my surprise I had arrived on a day where the Head Farm had turned into a giant activity area for three local schools who had come down to learn about growing, cooking and tending to the daily duties of the farm. A fine coincidence! The aim was to encourage social learning and appreciation for nature beyond the walls of classroom. Kids were encouraged to plant, tend and take care of their own bit of farm over the course of a season and at the end the produce was cooked into a multitude of delicious smelling dishes. </p>\n\n<p>Among many things I learned from this visit, I want to just touch on this one key insight. The business promotes this initiative and organises it separately from it&#8217;s core business of delivery boxes; but maybe there is an opportunity here to provide the same knowledge and inspiration (as seen with the children on the farm) through the channel of communication they already have with many people in the city of Copenhagen itself.</p>\n\n<p>There are many more insights but time is short and I need to get working on my design proposal! Check in for the weeknotes tomorrow for more on my thinking so far!</p>\n","excerpt":"<p>After yesterday&#8217;s visit to the allotments I was jumped at the opportunity to visit the Main Farm/Offices of food-box delivery service, [Aarstriderne][1]. The company has made a name for itself in Denmark through it&#8217;s effective delivery of fresh, organic, locally grown produce to the citizens of Copenhagen. From this, and two much larger farms outside of city, the business delivers to approx. 40,000 households throughout Denmark. </p>\n"}