{"title":"SD Update: Visualising the system","excerpt":"<p>Our concept is shaping up quite nicely now thanks to the effort put in from all the passengers we engaged in experience prototyping. Firstly a big thanks to them and all the staff again at CPH for all their invaluable help in accommodating us the past week. My colleagues are busy preparing for the presentation we will be giving this coming Friday and I&#39;ve been busy preparing the supplementary information that we will be providing in support of our presentation.</p>\n","date":"20 August","image":"http://m-jo.s3.amazonaws.com/diagramz-01.jpeg","project":"cph","content":"<p>Our concept is shaping up quite nicely now thanks to the effort put in from all the passengers we engaged in experience prototyping. Firstly a big thanks to them and all the staff again at CPH for all their invaluable help in accommodating us the past week. My colleagues are busy preparing for the presentation we will be giving this coming Friday and I&#39;ve been busy preparing the supplementary information that we will be providing in support of our presentation.</p>\n\n<p><strong>Our concept is two fold.</strong></p>\n\n<p>CPH Cloud is the overarching networked service platform that gives support and new opportunities to passengers, staff and retailers by connecting them together, prompting them with useful information at opportune moments throughout the airport (space &amp; time) and providing a key platform for expansion of the traveling experience in the future.</p>\n\n<p>FlashTicket is CPH Cloud platform service application that allows passengers to credit a boarding pass with money and spend it at the airport, both on their journey and on future journeys. The service provides incentives in the form of rounding-up spare change and special offers and discounts from retailers.</p>\n\n<p>Here you can see our vision of how CPHCloud can be an enabler for many more such service applications each providing the passenger with increased choice and convenience and in return providing the airport with information about passengers usage of the Terminal building.</p>\n\n<p><img src=\"http://m-jo.s3.amazonaws.com/diagramz-01.jpeg\" alt=\"Diagramz 01\" title=\"diagramz-01.jpg\" /> </p>\n\n<p>For individuals, both passengers and staff, the CPH Cloud is the key to providing a flow of information that is delivered throughout the airport to the right people, at the right times. This simple core value provides the foundation for platform services, such as FlashTicket, to create a comfortable travel experience for passengers and an efficient work environment for staff.</p>\n\n<p>For the airport, airlines and retailers CPH Cloud opens up new channels to provide useful, meaningful information services to passengers and staff and empowers them to develop new passenger service interactions improving brand impressions all the way up to Copenhagen as a flight destination. </p>\n\n<p>For the airport alone the power of collecting this information as passengers use the system will improve understanding of people&#39;s use of the airport and apply this knowledge to future experience improvements.</p>\n\n<p>At the system point of view of CPH Cloud, the main user is actually the airport and all entities that operate within it. It exists to facilitate the connection between stakeholders; passenger, staff, airline and retailers. Below is a detailed view exactly what flows where in the case of Flash Ticket.</p>\n\n<p><img src=\"http://m-jo.s3.amazonaws.com/business_A3-01.jpeg\" alt=\"Business A3 01\" /> </p>\n\n<p>In the case of our example platform service application, FlashTicket, the target user group are casual to relatively frequent leisure travelers. FlashTicket can of course be useful in many special cases from depositing money on a boarding pass for unaccompanied minors to business travelers collecting leftover change on their online FlashTicket account. The final breakdown below is a look at how more specialist passengers could benefit from CPHCloud and FlashTicket.</p>\n\n<p><img src=\"http://m-jo.s3.amazonaws.com/use-cases-01.jpeg\" alt=\"Use cases 01\" /> </p>\n\n<p>Look out for the final video coming soon, just putting the finishing touches. Hopefully looking to describe the service from a more passenger focused view point.</p>\n","postid":7}