{"title":"Prototyping Plan!","excerpt":"<p>Just finished the prototyping plan for this week and next. Six prototypes planned in all, each one slightly different from another but all using the service I&#39;ve mentioned before as a core. The box will (hopefully) focus the prototypes a bit and help me get them done in such a such a short space of time so as to not get stuck in trying to design the perfect box! </p>\n","date":"03 November","image":"http://m-jo.s3.amazonaws.com/IMG_7818.jpeg","project":"urbbi","content":"<p>Just finished the prototyping plan for this week and next. Six prototypes planned in all, each one slightly different from another but all using the service I&#39;ve mentioned before as a core. The box will (hopefully) focus the prototypes a bit and help me get them done in such a such a short space of time so as to not get stuck in trying to design the perfect box! </p>\n\n<p>As a bit of insight into my process below is a bit of scattered visualisation of my process from the research summary drawn up for brainstorming and through to my first design themes.</p>\n\n<p><img src=\"http://m-jo.s3.amazonaws.com/process_map-01.jpeg\" alt=\"process\"></p>\n\n<p>From my design themes I&#39;ve laid out the six prototypes corresponding to each theme. Two prototypes for each theme exploring the concepts from the amazing brainstorming session I had here with fellow CIID&#39;ers. Each prototype asks the questions posed by some of the concepts in a physical way so that I can get as much engagement in the experience prototyping sessions a possible.</p>\n\n<p>The prototypes are:</p>\n\n<h3>Smarter Service Relationship</h3>\n\n<p>Prototype 01a - Home delivery herbs<br>\nA plant box for your home that delivers information</p>\n\n<p>Activity:<br>\nSet up a &quot;herb-box&quot; (like a post box) outside flat/house and over time deliver fresh herbs.</p>\n\n<p>Prototype 01b - Communal/Family activity<br>\nA plant box for your home that encourages information sharing in a local environment (family/communal living)</p>\n\n<p>Activity:<br>\nA fresh box of herbs with labels on what the herbs are.<br>\nAll the labels are blank and the participants need to fill in what information they would like to store there if it existed in the kitchen.</p>\n\n<h3>Learning Together</h3>\n\n<p>Prototype 02a - Sharing knowledge<br>\nEncouraging remote sharing of knowledge by leveraging the services existing communication channel</p>\n\n<p>Activity:<br>\nA delivered herb box has a book where you can write or attach notes. The activity is to think of something you would write there to someone who may receive the same box in the future.</p>\n\n<p>Prototype 02b - Physical connection<br>\nEncouraging physical sharing of knowledge and produce in a local community area (block of flats/neighbourhood)</p>\n\n<p>Activity:<br>\nA communal box in the hall of a block flats that has take away cards with recipes and herbs. Front is the recipe and fold out are invitation tokens to people for dinner.</p>\n\n<h3>Co-creation Culture</h3>\n\n<p>Prototype 03a - Modularity<br>\nA base (herb box) that allows extension to allow urban gardening at home. Encouraging great range of freedom in creating a growing system from the herb box.</p>\n\n<p>Activity:<br>\nA herb box comes with fold out paper &quot;limbs&quot; that suggest extension for extra growing space, watering system, embedded seeds, etc.<br>\nTBC - QR codes attached to the &quot;limbs&quot; of the box allows you to see blueprints of extendability using everyday items around the house</p>\n\n<p>Prototype 03b - Networking<br>\n&quot;Making plants talk&quot;. Physically effecting each others gardens/plants to teach &amp; inform.</p>\n\n<p>Activity:<br>\nA box with LEDS that indicate when the &quot;master gardener&quot; is caring for the plant so you can join in. (LEDS specific to watering for now). + sticker that makes it clear what it&#39;s about and it&#39;s not just a light.</p>\n\n<p>Let&#39;s get making!</p>\n\n<p><span><img src=\"http://m-jo.s3.amazonaws.com/IMG_7818.jpeg\" alt=\"process\"></span></p>\n","postid":18}