{"title":"SD Update: Coming up with the idea&#8230;","author":"Mac","layout":"post","date":"2011-08-10 00:00:00 +0200","url":"/2011/08/10/sd-update-coming-up-with-the-idea.html","id":"/2011/08/10/sd-update-coming-up-with-the-idea","categories":[],"tags":[],"path":"_posts/2011-08-10-sd-update-coming-up-with-the-idea.md","content":"<p>*Here&#8217;s a quick update from the front.<br>\n*</p>\n\n<p>Currently the class at CIID is engaged in brainstorming and idea generation for the Service Design course. We&#8217;ve been mainly based at the airport all of last week and this week working mainly as a group, running workshops between teams to help each other come up with potential idea directions.</p>\n\n<p>From our session earlier:<br>\n<strong>&#8220;An inspirational shadowing exercise conducted with a budget traveller early in our process showed that for almost 50% of the time you are doing nothing in an airport; you are waiting. We expanded this to investigate passenger mindset and communication of information in order to better understand the reasons for and opportunities in waiting.&#8221;</strong></p>\n\n<p>We then held a brainstorm around our research questions (check them out <a href=\"/2011/08/06/service-design-for-the-airport/\">here</a>).</p>\n\n<p>Some great ideas have come out and we&#8217;ve already started identifying a few of them that could be prototyped. Here&#8217;s my colleague on what we&#8217;re working around now:<br>\n<strong>&#8220;Some first run concepts explored providing a learning experience in the form of an airport library, a universal ticketing system incorporating wider infrastructure of Copenhagen to give passengers an opportunity to plan their journey and local network infrastructure based on communicating the right information at the right time to both passengers and staff.&#8221;</strong></p>\n\n<p>Looks like we&#8217;re leaning toward the idea of an infrastructural service/system that allows passengers to deposit leftover change from their trip on their airline account to be used with their ticket whenever they are at CPH airport in the future.</p>\n\n<p><img src=\"/attach/IMG_8564.jpeg\" alt=\"IMG 8564\" title=\"IMG_8564.jpg\" border=\"0\" width=\"600\" height=\"450\" /></p>\n","excerpt":"<p>*Here&#8217;s a quick update from the front.<br>\n*</p>\n"}