{"title":"The Design Proposal","excerpt":"<p>The latter part of this week was spent mostly pulling together my research, initial ideas and concepts from multiple brainstorming sessions and the final result is my design proposal below. It&#8217;s not deep by any means but I feel it is a good enough point to start exploring with prototypes proceeding week four (I&#8217;m currently finalising plans for prototyping in Paris!). </p>\n","date":"07 October","image":"http://m-jo.s3.amazonaws.com/ajoto/ajoto.jpg","project":"urbbi","content":"<p>The latter part of this week was spent mostly pulling together my research, initial ideas and concepts from multiple brainstorming sessions and the final result is my design proposal below. It&#8217;s not deep by any means but I feel it is a good enough point to start exploring with prototypes proceeding week four (I&#8217;m currently finalising plans for prototyping in Paris!). </p>\n\n<p>My main focus for this project, as is explained below in the diagram, is to first create a service of convenience and then on the back of that foundation attempt to develop a project which starts to push towards the second circle to the left and ultimately answering the question mark in the middle. It&#8217;s funny to think of my project as a question mark after all these last few weeks research and investigation but I really believe that question mark has such great value and opportunity embedded in it.</p>\n\n<p><img src=\"/attach/proposal-01.jpeg\" alt=\"Proposal 01\" title=\"proposal-01.jpg\" border=\"0\" width=\"600\" height=\"423\" /> \n<span style='text-decoration:underline;'>So what, exactly, is my design challenge?<br /> </span></p>\n\n<p>To create a product-service that helps busy, urban citizens who have the desire to eat healthily, get started with landless gardening in their own flats/apartments. This would exist within the context of, first, a convenient subscription service delivering fresh, still-growing herbs to the customers’ door. Then using this channel of communication between consumer and service I want to explore how, consequently, I can help consumers maintain a garden themselves by progressively connecting them to the right knowledge about how to care for it and eventually to other gardeners/customers for inspiration and support.</p>\n\n<p>My ultimate goal would be to provide a product/service intervention that would be progressive, convenient and modular and would exist as platform upon which customers can help and inform each other, co-create new products themselves and help to promote a sustainable way of living.</p>\n\n<p><span style='text-decoration:underline;'>Why?<br /> </span></p>\n\n<ol>\n<li> \n<em>The popularity of such services as Aarstiderne in Denmark and others worldwide have shown a opportunity to inspire people to eat healthily by providing a convenient service which takes a lot of the effort out of doing so. However, inspiring people to grow something themselves still remains an area of opportunity.</em></li>\n</ol>\n\n<p>How can I create a smarter relationship between individual customers and the service by encouraging them to learn how to grow their own through knowledge exchange and experimentation?</p>\n\n<ol>\n<li> \n<em>Providing a system that starts small and allows the consumer to scale up in a convenient way to the point where growing something feels comfortable and even enjoyable.</em></li>\n</ol>\n\n<p>How can I create a scalable system for apartment gardening by making it convenient and informative?</p>\n\n<ol>\n<li> \n<em>Waiting lists have become the bane of any beginner gardener in the city. Allotments and urban gardening initiatives are struggling to keep up with demand. A clear indicator that people want to get involved in gardening and all for different reasons.</em></li>\n</ol>\n\n<p>How can I include those who already garden into the service to encourage people in the city to explore growing in their own homes?</p>\n\n<ol>\n<li> \n<em>To respond to increasing urban population and urban density.</em></li>\n</ol>\n\n<p>How can I leverage increased population density to inspire sharing of knowledge and produce by opening channels of communications between customers?</p>\n\n<ol>\n<li> \n<em>Increase social engagement between neighbours, communities, the service and other customers/gardeners.</em></li>\n</ol>\n\n<p>How can I create a user group culture to inspire customers to learn and create together by simply delivering a system with increasing potential the more involved a customer gets?</p>\n"}