{"title":"Service Design for the Airport!","author":"Mac","layout":"post","date":"2011-08-06 00:00:00 +0200","url":"/2011/08/06/service-design-for-the-airport/","id":"/2011/08/06/service-design-for-the-airport","categories":[],"tags":[],"path":"_posts/2011-08-06-service-design-for-the-airport.md","content":"<p>A major new module in the CIID education just started an our focus for it is designing services in partnership with Copenhagen Airport. The class are expected to integrate into the complex system of the airport having been graciously given security clearance to conduct research both air-side and land-side. This amazing opportunity gives us the chance to conduct rich user research and grants us access to both passengers and staff for co-creation sessions and user testing of service touchpoint prototypes. </p>\n\n<p>After our initial briefings we spent the week conducting passenger &amp; staff interviews around the airport which turned us (as a sub-team) onto the area of &#8216;waiting&#8217;. An experience we are all well used to by now as wealthy, jet-setting first world citizens. A broad area indeed and not without it&#8217;s fair share of emotions! In fact just overcoming the tense feeling of being in an airport was the first step for the class as a whole. It&#8217;s difficult not to let the high emotions and tense environment get to you. Luckily after a few days of the freedom our security clearance allows everything came naturally and everyone got into the swing of the research process.</p>\n\n<p><img src=\"/attach/IMG_5451-1.jpeg\" alt=\"IMG 5451 1\" title=\"IMG_5451 1.jpg\" border=\"0\" width=\"600\" height=\"400\" /> \nWith a lot of ground needing to covered in a short amount of time, the teams at CIID quickly focused down on creating focused areas around which to brainstorm and come up with service concepts. The presentation below details our insights from the research and areas of interest going forward so I won&#8217;t go into too much detail there, but just to say that our next big checkpoint we are working towards is the design phase in which a round of brainstorming will hopefully bring out some interesting new service concepts for the future. Look out for that soon. Back to work!</p>\n","excerpt":"<p>A major new module in the CIID education just started an our focus for it is designing services in partnership with Copenhagen Airport. The class are expected to integrate into the complex system of the airport having been graciously given security clearance to conduct research both air-side and land-side. This amazing opportunity gives us the chance to conduct rich user research and grants us access to both passengers and staff for co-creation sessions and user testing of service touchpoint prototypes. </p>\n"}